---
kind: property
id: P:Autodesk.Revit.DB.NavisworksExportOptions.Parameters
source: html/7bc7e2e4-535a-8975-636f-a3af2ba87d55.htm
---
# Autodesk.Revit.DB.NavisworksExportOptions.Parameters Property

Options which specifies the parameter conversion of Navisworks Exporter.
 Default value is All.

## Syntax (C#)
```csharp
public NavisworksParameters Parameters { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration